app/views/home/index.html.erb

SELECT `offers`.* FROM `offers`
---
			<tbody>
				<% Offer.all.each do |offer|%>