app/controllers/offers_controller.rb

SELECT `offers`.* FROM `offers`
---
	def index
		@offers = Offer.all

INSERT INTO `offers` (`created_at`, `departure`, `destination`, `updated_at`) VALUES ('2014-11-07 10:36:02', 'ss', 'ss', '2014-11-07 10:36:02')
---
	def create
		@offer = Offer.new(offer_params)
		@offer.save